/* eslint-disable no-unused-vars */
import { motion } from "framer-motion";
import QualityOfLifeChart from "../components/charts/QualityOfLifeChart";
import { Heart } from "lucide-react";
import Details from "../components/config/details.json";
import Accordion from "../components/ui/Accordion";

export default function QualityOfLife() {
 const data = [
    [92, 99, 96, 88, 88, 88], //dehkhoda
    [88, 86, 100, 91, 78, 83], //bolvar
    [89, 80, 60, 84, 81, 85], //seyedi
    [96, 99, 75, 98, 68, 73], //17شهریور
    [86, 94, 70, 95, 88, 73], //میرزاکوچکخان
    [50, 94, 35, 40, 30, 40], //shahidbeheshti
    [87, 98, 30, 90, 63, 38], //jajarmi
    [83, 90, 81, 73, 75, 73], //hoseinymasoom
    [86, 88, 50, 88, 76, 48], //shariati ];
    [88, 90, 46, 89,82,30], //dochenar
    [80, 81, 42, 80, 69, 52], //chamran
    [94, 85, 84, 88, 93, 90], //artesh
    [96, 94, 96, 89, 84, 59], //bsij
    [96, 90, 75, 91, 88, 80], //jomhori
    [85, 82, 90, 82, 92, 90], //کوی معلم
    [82, 80, 50, 89, 77, 72], //mosala
  ];
  //   4  "سرزندگی اجتماعی",
  //    2 "دسترسی به خدمات شهری",
  //  6   "فضای سبز و آرامش",
  //   3  "امنیت",
  //    5 "کیفیت کالبدی محله",
  // 1 ترافیک

  const names = [
    "دهخدا",
    "بلوار",
    "سیدی",
    "17شهریور",
    "میرزاکوچک خان",
    "شهید بهشتی",
    "جاجرمی",
    "حسینی معصوم",
    "شریعتی",
    "دوچنار",
    "چمران",
    "ارتش",
    "بسیج",
    "جمهوری",
    "کوی معلم",
    "مصلی",
  ];
  return (
    <section className="">
      <div className="w-full grid grid-cols-1 lg:grid-cols-2 gap-3 mt-3">
        {/* Box for text */}
        <motion.div
          initial={{ opacity: 0, y: 20 }}
          animate={{ opacity: 1, y: 0 }}
          transition={{ duration: 0.6 }}
          className="relative border bg-white/50 backdrop-blur-md rounded-2xl shadow-md p-5  col-span-2 lg:col-span-1  h-[100%]"
        >
          <h3 className="text-3xl sm:text-2xl   w-full flex flex-row-reverse aling-centeritems-center text-right justify-end gap-2  font-modam font-extrabold   text-[var(--text)]  leading-snug ">
            محله بسیج محله ای برای سکونت و تجارت
            <Heart size={28} />
          </h3>
          <p className="lg:leading-loose  font-modam  text-justify text-base mb-6  ">
            محله بسیج (میرزا رضای کرمانی) با موقعیت مرکزی و دسترسی آسان به
            خیابان‌های طالقانی و امام خمینی، از محله‌های مهم و ارزشمند بجنورد
            است. این محله که در دهه ۷۰ برای اسکان نیروهای نظامی شکل گرفت، امروز
            ترکیبی از بافت قدیمی و ساختمان‌های نوساز را در خود جای داده و روند
            نوسازی و توسعه عمودی در آن ادامه دارد. کمبود زمین بایر و تقاضای
            بالای سکونت، ارزش سرمایه‌گذاری را در این محدوده افزایش داده است.
            تنوع کاربری‌های تجاری، آموزشی، فرهنگی و درمانی، همراه با دسترسی به
            پارک نادر و خانه فرهنگ، کیفیت زندگی را ارتقا داده است. وجود کوچه‌های
            بن‌بست و ترافیک در ساعات اوج از چالش‌های محله است، اما در مجموع بسیج
            محیطی مناسب برای سکونت خانوادگی و فعالیت‌های تجاری به شمار می‌رود.
          </p>
          <Accordion
            title=" 🔐  امنیت:89"
            content="گشت نیروی انتظامی در محله _ روشنایی مناسب در معابر _ وجود پنجره‌های مشرف به خیابان _ شلوغ بودن محله _ تعداد کم زمین‌های خالی یا گوشه‌های بلااستفاده _ وجود کوچه‌های بن‌بست _ وجود دوربین‌های مدار بسته در سطح محله _ فعالیت کاربری‌های مختلف در طول شبانه روز  _ نزدیکی به مرکز شهر _ امنیت پایین در محدوده پارک نادر"
            defaultOpen={false}
          />
          <Accordion
            title="	 🏪  دسترسی به خدمات:98  "
            content="دسترسی مطلوب به خدمات محلی و بازار اصلی شهر _ دسترسی به حمل‌ونقل عمومی _ وجود فضاهای تفریحی و گذران اوقات فراغت _ دسترسی به مراکز خرید روزمره _ وجود درمانگاه _ عدم وجود مسجد _ وجود مدارس در محله _ وجود بنای تاریخی ، بانک ملی"
            defaultOpen={false}
          />{" "}
          <Accordion
            title=" 🌱 فضای سبز و آرامش :90 "
            content="وجود پارک نادر به‌عنوان فضای سبز اصلی _ درختکاری خیابانی و باغچه‌های محلی _ سایه‌اندازی مناسب در معابر"
            defaultOpen={false}
          />{" "}
          <Accordion
            title=" 	🤝  سرزندگی اجتماعی:96 "
            content="حضور و تعامل مداوم افراد در محله _ وجود خانه فرهنگ به‌عنوان پارک وفضای اجتماعی  _ ارتباط نسبتاً کم میان برخی ساکنان _ شکل‌گیری تعاملات اجتماعی در محله _ وجود کافه، رستوران، باشگاه و فضاهایی برای گذران اوقات فراغت"
            defaultOpen={false}
          />{" "}
          <Accordion
            title=" 🏡 کیفیت کالبدی محله:84 "
            content="قدمت نسبتاً بالای بافت محله _ کیفیت مناسب معابر سواره و پیاده _ نظافت و پاکیزگی مطلوب _ وجود تابلوها، علائم ترافیکی و محوطه‌آرایی در خیابان‌های اصلی _ تعداد محدود زمین‌های بایر یا مخروبه _ روند رو به رشد ساخت‌وساز و بازسازی املاک"
            defaultOpen={false}
          />{" "}
          <Accordion
            title="
              🚦 ترافیک:65  "
            content="تعداد بالای معابر بن‌بست _ یک‌طرفه بودن دو معبر اصلی (طالقانی غربی و امیریه جنوبی) _ گره‌های ترافیکی در اطراف محله _ وجود معبر جمع‌وپخش‌کننده میرزارضا کرمانی _ قرارگیری در بخش مرکزی شهر و مجاورت با بازار "
            defaultOpen={false}
          />
        </motion.div>

        {/* Box for chart */}
        <motion.div
          initial={{ opacity: 0, y: 20 }}
          animate={{ opacity: 1, y: 0 }}
          transition={{ duration: 0.8, delay: 0.2 }}
          className="col-span-2 lg:col-span-1  h-full"
        >
          <QualityOfLifeChart dataValues={data} names={names} />
        </motion.div>
      </div>
    </section>
  );
}
